In [1]:
import pandas as pd

In [2]:
from pandas import DataFrame, Series

In [3]:
import numpy as np

# Series, creation merging and combining.

In [8]:
sr1 = Series(np.arange(10), index=list('ABCDEFGHIJ'))

In [105]:
sr2 = Series(np.arange(11,21), index=list('ABCDEFGHIJ'))

In [72]:
print(sr1)

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int32


# DataFrames, creation, index, columns, merging, combining, tranform, transpose

In [73]:
df1 = DataFrame(sr1.values, index=sr1.index)

In [74]:
df1 = df1.transpose()

In [75]:
df1

   A  B  C  D  E  F  G  H  I  J
0  0  1  2  3  4  5  6  7  8  9

In [76]:
# Appending rows, needs to be asigned to the dataframe
df1 = df1.append(sr2, ignore_index=True)

In [77]:
# Assigning an index to the dataframe
df1.index = ["Start", "End"]

In [78]:
df1

        A   B   C   D   E   F   G   H   I   J
Start   0   1   2   3   4   5   6   7   8   9
End    11  12  13  14  15  16  17  18  19  20

In [79]:
# Getting columns
df1['A']

Start     0
End      11
Name: A, dtype: int32

In [80]:
# Getting rows by index numbers
df1.iloc[0]

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
Name: Start, dtype: int32

In [81]:
# Getting rows by index name
df1.loc['Start']

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
Name: Start, dtype: int32

In [141]:
# Creating dataframe with indexes but rotating for columns to have the desired names
df2 = DataFrame(data=np.arange(21, 31), index=list('ABCDEFGHIJ')).transpose()

In [142]:
df2

    A   B   C   D   E   F   G   H   I   J
0  21  22  23  24  25  26  27  28  29  30

In [125]:
# Appending dataframes with same indexes
df1.append(df2.iloc[0], ignore_index=True)

    A   B   C   D   E   F   G   H   I   J
0   0   1   2   3   4   5   6   7   8   9
1  11  12  13  14  15  16  17  18  19  20
2  21  22  23  24  25  26  27  28  29  30

In [143]:
# Concatenating dataframes with same indexes, no need to add extra info
pd.concat([df1, df2])

        A   B   C   D   E   F   G   H   I   J
Start   0   1   2   3   4   5   6   7   8   9
End    11  12  13  14  15  16  17  18  19  20
0      21  22  23  24  25  26  27  28  29  30

In [152]:
df3 = DataFrame(np.arange(31,41).reshape((2,5)))

In [153]:
df3

    0   1   2   3   4
0  31  32  33  34  35
1  36  37  38  39  40

In [147]:
df4 = DataFrame([[1,2,3], [4,5,6]])

In [150]:
np.array([1,2,3,4,5,6]).reshape((2,3))

array([[1, 2, 3],
       [4, 5, 6]])